/* eslint-disable import/prefer-default-export */
export const staticText = {
  search: {
    category: {
      ru: 'Категории',
      ua: 'Категорії',

    },
    products: {
      ru: 'Товары',
      ua: 'Товари',
    },
  },
  delivery: {
    1: {
      ru: 'Самовывоз со склада',
      ua: 'Самовивіз зі склада',
    },
    2: {
      ru: 'Доставка Новой Почтой',
      ua: 'Доставка Новою Поштою',
    },
    3: {
      ru: 'Доставка на склад покупателя',
      ua: 'Доставка до складу покупця',
    },
  },
  registrationRight: {
    topText: {
      ru:
        'Если перед Вами периодически возникает задача подготовить проект по кухонному оборудованию или мебели, приглашаем стать членом нашего клуба архитекторов и дизайнеров: предоставляемый нашей компанией пакет услуг избавит Вас от ненужных хлопот, переложив их на плечи профессионалов.',
      ua:
        'Якщо перед Вами періодично виникає завдання підготувати проект щодо кухонного обладнання або меблів, запрошуємо стати членом нашого клубу архітекторів і дизайнерів: пакет послуг, що надається нашою компанією, позбавить Вас зайвого клопоту, перекладе їх на плечі професіоналів.',
    },
    cardAdvantage: {
      ru: 'Преимущества клубной карты «Алкотек»:',
      ua: 'Переваги клубної карти «Алкотек»:',
    },
    cardAdvantageFirst: {
      ru:
        'выгодные коммерческие условия по всему спектру наших товаров и услуг;',
      ua:
        'вигідні комерційні умови по всьому спектру наших товарів і послуг;',
    },
    cardAdvantageSecond: {
      ru: 'доступ к участию в специальных торговых акциях;',
      ua: 'доступ до участі в спеціальних торгових акціях;',
    },
    cardAdvantageThird: {
      ru: 'работа с персональным менеджером;',
      ua: 'робота з персональним менеджером;',
    },
    cardAdvantageFourth: {
      ru: 'индивидуальные консультации в шоурумах компании;',
      ua: 'індивідуальні консультації в шоурумах компанії;',
    },
    cardAdvantageFifth: {
      ru: 'индивидуальная сервисная поддержка;',
      ua: 'індивідуальна сервісна підтримка;',
    },
    cardAdvantageSixth: {
      ru: 'логистическая, информационная и сервисная поддержка в регионах;',
      ua: 'логістична, інформаційна та сервісна підтримка в регіонах;',
    },
    cardAdvantageSeventh: {
      ru: 'возможность бесплатной рекламы на нашем сайте.',
      ua: 'можливість безкоштовної реклами на нашому сайті.',
    },
  },
  registrationForm: {
    items: {
      ru: [
        'Мебельные салоны и кухонные студии',
        'Архитекторы, дизайнеры, freelancers',
        'Интернет-магазины',
        'Оптовые партнеры',
        'Данная категория не будет доступна для внешних клиентов',
        'Сетевые партнеры (региональные и всеукраинские сети), Мегамаркеты сетевые',
        'Застройщики, Девелоперские организации',
      ],
      ua: [
        'Меблеві салони та кухонні студії',
        'Архітектори, дизайнеры, freelancers',
        'Інтернет-магазини',
        'Оптові партнери',
        'Дана категорія не буде доступною для зовнішніх клієнтів',
        'Мережеві партнери (регіональні та всеукраїнські мережі), Мегамаркети мережеві',
        'Забудовники, Девелоперські організації',
      ],
    },
    regTitle: {
      ru:
        'Выберите наиболее подходящую для своего вида деятельности группу сотрудничества',
      ua:
        'Оберіть найбільш прийнятну для свого виду діяльності групу співпраці',
    },
    allData: {
      ru: 'Основные данные',
      ua: 'Основні дані',
    },
    nameSurname: {
      ru: 'ФИО*',
      ua: 'ПІБ*',
    },
    phoneNumber: {
      ru: 'Телефон',
      ua: 'Телефон',
    },
    email: {
      ru: 'Ваша электронная почта*',
      ua: 'Ваша електронна пошта*',
    },
    reg: {
      ru: 'Зарегистрироваться',
      ua: 'Зареєструватися',
    },
  },
  passwordRecovery: {
    popupTitle: {
      ru: 'Вoсстановление пароля',
      ua: 'Відновлення паролю',
    },
    popupText: {
      ru:
        'Введите адрес почты, который был использован при регистрации. Пароль вам будет отправлен автоматически',
      ua:
        'Введіть адресу пошти, яка була використана при реєстрації. Пароль вам буде відправлено автоматично',
    },
    emailText: {
      ru: 'Ваша электронная почта',
      ua: 'Ваша електронна пошта',
    },
    sendText: {
      ru: 'Отправить',
      ua: 'Відправити',
    },
  },
  login: {
    logTitle: {
      ru: 'Вход для клиентов',
      ua: 'Вхід для клієнтів',
    },
    loginText: {
      ru: 'Логин',
      ua: 'Логін',
    },
    passwordText: {
      ru: 'Пароль',
      ua: 'Пароль',
    },
    recoveryPass: {
      ru: 'Забыли пароль?',
      ua: 'Забули пароль?',
    },
    entrance: {
      ru: 'Войти',
      ua: 'Увійти',
    },
    forClient: {
      ru: 'Хотите стать нашим клиентом?',
      ua: 'Бажаєте стати нашим клієнтом?',
    },
    forReg: {
      ru: 'Подать заявку',
      ua: 'Подати заявку',
    },
  },
  productTabs: {
    ru: ['Общее описание', 'Характеристики', 'Особенности'],
    ua: ['Загальний опис', 'Характеристики', 'Особливості'],
  },
  sale: {
    1: {
      ru: 'До конца акции осталось:',
      ua: 'До кінця акції залишилося:',
    },
    2: {
      ru: 'Дней',
      ua: 'Днів',
    },
    3: {
      ru: 'Часов',
      ua: 'Часів',
    },
    4: {
      ru: 'Минут',
      ua: 'Хвилин',
    },
    5: {
      ru: 'Секунд',
      ua: 'Секунд',
    },
  },
  tabs: [
    {
      link: 'projects',
      path: '/profile/projects',
      name: {
        ru: 'Проекты',
        ua: 'Проекти',
      },
    },
    {
      link: 'orders',
      path: '/profile/orders',
      name: {
        ru: 'Заказы поставщику',
        ua: 'Замовлення постачальнику',
      },
    },
    {
      link: 'training',
      path: '/profile/training',
      name: {
        ru: 'Обучение',
        ua: 'Навчання',
      },
    },
    {
      link: 'personalPromo',
      path: '/profile/promo',
      name: {
        ru: 'Персональные акции',
        ua: 'Персональні акції',
      },
    },
    {
      link: 'configurator',
      path: '/profile/configurator',
      name: {
        ru: 'Конфигуратор',
        ua: 'Конфигуратор',
      },
    },
  ],
  popups: {
    registrationSuccess: {
      popupTitle: {
        ru: 'Спасибо за Вашу заявку',
        ua: 'Дякуємо за Вашу заявку',
      },
      popupText: {
        ru: 'Ваш запрос будет обработан в течении 1го рабочего дня',
        ua: 'Ваш запит буде оброблено протягом 1 робочої доби',
      },
    },
    recoverySuccess: {
      popupTitle: {
        ru: 'Запрос отправлен',
        ua: 'Запит відправлено',
      },
      popupText: {
        ru: 'Проверьте Вашу электронную почту',
        ua: 'Перевірте Вашу електронну пошту',
      },
    },
    1: {
      ru: 'Введите число от 1 до 9999.',
      ua: 'Введіть число від 1 до 9999.',
    },
    2: {
      ru: 'Ваш новый пароль успешно сгенерирован и отправлен на почту.',
      ua: 'Ваш новий пароль успішно згенерований і відправлений на пошту.',
    },
    3: {
      ru: 'Что-то пошло не так, попробуйте снова.',
      ua: 'Щось пішло не так, спробуйте знову.',
    },
    popupSave: {
      ru: 'Вы хотите сохранить текущий проект?',
      ua: 'Ви хочете зберегти поточний проект?',
    },
    popupTitle: {
      ru: 'Вы уверены?',
      ua: 'Ви впевнені?',
    },
    popupTitleProject: {
      ru: 'Вы уверены, что хотите удалить проект?',
      ua: 'Ви впевнені, що бажаєте видалити проект?',
    },
    popupTitleCompare: {
      ru: 'Выбранные для сравнения товары при переходе на другую категорию товаров  будут удалены из сравнения. Вы уверены?',
      ua: 'Обрані для порівняння товари при переході на іншу категорію товарів будуть видалені з порівняння. Ви впевнені?',
    },
    popupTextYes: {
      ru: 'Да',
      ua: 'Так',
    },
    popupTextNo: {
      ru: 'Нет',
      ua: 'Ні',
    },
  },
  titles: {
    contactsKiev: {
      ru: 'Наши контакты в Киеве',
      ua: 'Наші контакти у Києві',
    },
    inDevelop: {
      ru: 'Страница находится в разработке',
      ua: 'Сторінка знаходиться у розробці',
    },
    regTitle: {
      ru: 'Подача заявки на регистрацию',
      ua: 'Подання заявки на реєстрацію',
    },
    action: {
      ru: 'Персональные акции',
      ua: 'Персональні акції',
    },
    personalPromo: {
      ru: 'В акции участвуют:',
      ua: 'В акції беруть участь:',
    },
    subTitle: {
      ru: 'Рекомендованная розничная цена',
      ua: 'Рекомендована роздрібна ціна',
    },
    training: {
      ru: 'Обучение',
      ua: 'Навчання',
    },
    error: {
      ru: 'Заполните все обязательные поля (*)',
      ua: "Заповніть усі обов'язкові поля (*)",
    },
  },
  text: {
    1: {
      ru: 'С',
      ua: 'З',
    },
    2: {
      ru: 'После оформления заказа вы не сможете его изменить. Редактированию доступна только дата отгрузки.',
      ua: 'Після оформлення замовлення ви не зможете його змінити. Редагування доступна тільки дата відвантаження.',
    },
    rename: {
      ru: 'Переименовать',
      ua: 'Перейменувати',
    },
    disableRecommendation: {
      ru: 'Отключить рекомендации',
      ua: 'Відключити рекомендації',
    },
    allPromos: {
      ru: 'Все акции',
      ua: 'Всі акції',
    },
    whereToBuy: {
      ru: 'Где можно купить',
      ua: 'Де можна придбати',
    },
    delivery: {
      1: {
        ru: 'Доставка бесплатная',
        ua: 'Доставка безкоштовна',
      },
      2: {
        ru: 'Стоимость доставки',
        ua: 'Вартість доставки',
      },
    },
  },
  btns: {
    1: {
      ru: 'Закрыть',
      ua: 'Зачинити ',
    },
    2: {
      ru: 'Купить на сайте магазина',
      ua: 'Купити на сайті магазина',
    },
    3: {
      ru: 'подробнее об акции',
      ua: 'детальніше про акцію'
    },
    4: {
      ru: 'Подробнее',
      ua: 'Детальніше',
    },
    5: {
      ru: 'Добавить в проект',
      ua: 'Додати до проекту',
    },
    6: {
      ru: 'Добавить к сравнению',
      ua: 'Додати до порівняння',
    },
    7: {
      ru: 'Перейти на товар',
      ua: 'Перейти до товару',
    },
    8: {
      ru: 'Сравнить',
      ua: 'Порівняти',
    },
    btnCreate: {
      ru: 'Создать новый проект',
      ua: 'Cтворити новий проект',
    },
    9: {
      ru: 'Вернуться',
      ua: 'Повернутися',
    },
    10: {
      ru: 'Подтвердить',
      ua: 'Підтвердити',
    },
  },
  rigthSidebar: {
    recomendText: {
      ru: 'Рекомендации',
      ua: 'Рекомендації',
    },
    weRecommend: {
      ru: 'К этим товарам в проекте мы рекомендуем',
      ua: 'До цих товарів в проекті ми рекомендуємо',
    },
    closedSidebar: {
      ru: 'Товаров в проекте',
      ua: 'Товарів в проекті',
    },
    closedSidebarGuest: {
      ru: 'Товаров в корзине',
      ua: 'Товарів в кошику',
    },
    placeholder: {
      ru: 'Краткий комментарий',
      ua: 'Короткий коментарій',
    },
    text: {
      ru: 'У вас пока не добавлено ни одного товара в новый проект. Выбрав любую категорию товара, она будет отображаться в этой панели.',
      ua: 'У вас поки не додано жодного товару в новий проект. Обравши будь-яку категорію товару, вона буде відображатися в цій панелі.',
    },
    totalPrice: {
      ru: 'Итого:',
      ua: 'Всього:',
    },
    button: {
      save: {
        ru: 'Сохранить',
        ua: 'Зберегти',
      },
      check: {
        ru: 'Проверить',
        ua: 'Перевірити',
      },
      guest: {
        ru: 'Оформить заказ',
        ua: 'Оформити замовлення',
      },
    },
  },
  configurateArea: {
    closeFilterName: {
      ru: 'Фильтры',
      ua: 'Фільтри',
    },
    title: {
      ru: 'Категории товаров',
      ua: 'Категорії товарів',
    },
    searchPlaceholder: {
      ru: 'Я ищу...',
      ua: 'Я шукаю...',
    },
    searchTitle: {
      ru: 'История поиска',
      ua: 'Iсторія пошуку',
    },
    filterText: {
      ru: 'Подобрано',
      ua: 'Підібране',
    },
    filterTextFrom: {
      ru: 'товаров из',
      ua: 'товарів з',
    },
    buttonClear: {
      ru: 'Сбросить',
      ua: 'Скинути',
    },
  },
  headerTexts: {
    exchangeRate: {
      ua: 'Курс валют на сьогодні: ',
      ru: 'Курс валют на сегодня:',
    },
    dollarCurrency: {
      ua: 'Долар / Гривня',
      ru: 'Доллар / Гривна',
    },
    euroCurrency: {
      ua: 'Євро / Гривня',
      ru: 'Евро / Гривна',
    },
    menu: [
      {
        name: 'catalog',
        text: {
          ua: 'Каталог',
          ru: 'Каталог',
        }
      },
      {
        name: 'promo',
        text: {
          ua: 'Акції',
          ru: 'Акции',
        },
      },
      {
        name: 'brands',
        text: {
          ua: 'Брендинг',
          ru: 'Бренды',
        },
        header: {
          ua: 'Торгові марки, продукцію яких пропонує ГК "Алкотек"',
          ru: 'Торговые марки, продукцию которых предлагает ГК "Алкотек"',
        },
        description: {
          ua: 'Для отримання детальної информації про бренд клацніть на логотип',
          ru: 'Для получения детальной информации о бренде кликните на логотип',
        },
      },
      {
        name: 'partners',
        text: {
          ua: 'Партнери',
          ru: 'Партнеры',
        },
      },
      {
        name: 'vip',
        text: {
          ua: 'VIP-консалтинг',
          ru: 'VIP-консалтинг',
        },
      },
      {
        name: 'price',
        text: {
          ua: 'Прайс- листи',
          ru: 'Прайс-листы',
        },
      },
      {
        name: 'delivery',
        text: {
          ua: 'Доставка',
          ru: 'Доставка'
        },
      },
      {
        name: 'contacts',
        text: {
          ua: 'Контакти',
          ru: 'Контакты'
        },
      }
    ],
    profile: {
      login:
      {
        ua: 'Вхід до особистого кабінету',
        ru: 'Вход в личный кабинет',
      },
      logout:
      {
        ua: 'Вихід',
        ru: 'Выход',
      },
      languages: [
        {
          index: 'ru',
          text: 'РУС',
        },
        {
          index: 'ua',
          text: 'УКР',
        },
      ],
    },
  },
  additionalMenu: {
    menu: [{
      name: 'aboutCompany',
      text: {
        ua: 'Про компанію',
        ru: 'О компании'
      },
    },
    {
      name: 'news',
      text: {
        ua: 'Новини',
        ru: 'Новости'
      },
    },
    {
      name: 'career',
      text: {
        ua: 'Кар`єра з Alcotec',
        ru: 'Карьера с Alcotec'
      },
    },
    {
      name: 'services',
      text: {
        ua: 'Сервіси',
        ru: 'Сервисы'
      },
    },
    {
      name: 'partnerPrograms',
      text: {
        ua: 'Партнерські програми',
        ru: 'Партнерские программы'
      },
    },
    {
      name: 'contracts',
      text: {
        ua: 'Договори співпраці',
        ru: 'Договора сотрудничества'
      },
    }],
    footer: {
      ru: 'Все права защищены',
      ua: 'Усі права захищені'
    },
    office: {
      placeholder: {
        ru: 'Киев (главный офис)',
        ua: 'Київ (головний офіс)',
      },
      ru: ['Харьков', 'Киев (главный офис)', 'Днепр', 'Львов', 'Тернополь', 'Кропивницкий', 'Винница', 'Одесса', 'Запорожье', 'Херсон', 'Кременчуг', 'Луцк', 'Ужгород'],
      ua: ['Харків', 'Київ (головний офіс)', 'Дніпро', 'Львів', 'Тернопіль', 'Кропивницький', 'Вінниця', 'Одеса', 'Запоріжжя', 'Херсон', 'Кременчук', 'Луцьк', 'Ужгород'],
    },
  },
  configurator: {
    textSort: {
      title: {
        ru: 'Сортировать по',
        ua: 'Сортувати за',
      },
      rating: {
        ru: 'Рейтингу',
        ua: 'Рейтингом',
      },
      price: {
        ru: 'Цене',
        ua: 'Ціною',
      },
      popular: {
        ru: 'Популярности',
        ua: 'Популярності',
      },
    },
  },
  footerTexts: {
    contacts: {
      title: {
        ru: 'Контакты',
        ua: 'Контакти',
      },
      items: [
        {
          title: {
            ru: 'Киев (главный офис)',
            ua: 'Київ (головний офіс)',
          },
          phone: '+38 (044) 500-26-26',
          address: {
            ru: 'Киев, 04119, ул. Дегтярёвская 25-А, ЖК "Cosmopolitan", корпус 1, секция 3, офис 413',
            ua: 'Київ, 04119, вул. Дегтярівська 25-А, ЖК "Cosmopolitan", корпус 1, секція 3, офіс 413',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Харьков',
            ua: 'Харків',
          },
          phone: '+38 (057) 766-10-97',
          address: {
            ru: '61140, пр. Фонвизина 18, офис 215',
            ua: '61140, пр. Фонвізіна 18, офіс 215',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Днепр',
            ua: 'Дніпро',
          },
          phone: '+38 (050) 356-64-12',
          address: {
            ru: '49044, ул.Гоголя,15-в офис 18',
            ua: '49044, вул.Гоголя, 15-в офіс 18',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Львов',
            ua: 'Львів',
          },
          phone: '+38 (050) 443-77-31',
          address: {
            ru: '79035, ул. Зелена 149, корп. 4, оф. 217',
            ua: '79035, вул. Зелена 149, корп. 4, оф. 217',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Тернополь',
            ua: 'Тернопіль',
          },
          phone: '+38 (095) 831-04-73',
          address: {
            ru: '46023, пр. Злуки 4, кв. 78',
            ua: '46023, пр. Злуки 4, кв. 78',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Кропивницкий',
            ua: 'Кропивницький',
          },
          phone: '+38 (0522) 59-50-39',
          address: {
            ru: '25015, ул. Черновола 1-б',
            ua: '25015, вул. Чорновола 1-б',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Винница',
            ua: 'Вінниця',
          },
          phone: '+38 (0432) 55-03-88',
          address: {
            ru: '21021, ул. 600-летия 17, корп. 21',
            ua: '21021, вул. 600-річчя 17, корп. 21',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Одесса',
            ua: 'Одеса',
          },
          phone: '+38 (067) 716-60-32',
          address: {
            ru: '65009, ул. Фонтанская дорога 11, оф. 516',
            ua: '65009, вул. Фонтанська дорога 11, оф. 516',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Запорожье',
            ua: 'Запоріжжя',
          },
          phone: '+38 (061) 286-87-51',
          address: {
            ru: '69000, ул. Северное шоссе 4, каб. 307',
            ua: '69000, вул. Північне шосе 4, каб. 307',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Херсон',
            ua: 'Херсон',
          },
          phone: '+38 (0552) 42-44-46',
          address: {
            ru: '73000, ул. Гирского 29, оф. 1',
            ua: '73000, вул. Гірського 29, оф. 1',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Кременчуг',
            ua: 'Кременчук',
          },
          phone: '+38 (097) 322-99-22',
          address: {
            ru: '39602, пр. Свободы 54-а',
            ua: '39602, пр. Свободи 54-а',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Луцк',
            ua: 'Луцьк',
          },
          phone: '+38 (095) 831-04-73',
          address: {
            ru: '46023, пр. Злуки 4, кв. 78',
            ua: '46023, пр. Злуки 4, кв. 78',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
        {
          title: {
            ru: 'Ужгород',
            ua: 'Ужгород',
          },
          phone: '+38 (095) 275-59-67',
          address: {
            ru: '-',
            ua: '-',
          },
          days: {
            ru: 'ПН-ПТ:',
            ua: 'ПН-ПТ:',
          },
          time: {
            ru: 'с 9-00 до 18-00',
            ua: 'з 9-00 до 18-00',
          },
        },
      ],
    },
    linksTitle: {
      ru: 'Полезные ссылки',
      ua: 'Корисні посилання',
    },
    menu: [
      {
        name: 'aboutCompany',
        text: {
          ru: 'О компании',
          ua: 'Про компанію',
        },
      },
      {
        name: 'return',
        text: {
          ru: 'Условия возврата',
          ua: 'Умови повернення',
        },
      },
      {
        name: 'news',
        text: {
          ru: 'Новости',
          ua: 'Новини',
        },
      },
      {
        name: 'termsPayment',
        text: {
          ru: 'Условия оплаты',
          ua: 'Умови оплати',
        },
      },
      {
        name: 'career',
        text: {
          ru: 'Карьера с Alcotec',
          ua: 'Кар`єра з Alcotec',
        },
      },
      {
        name: 'contractOffer',
        text: {
          ru: 'Договор оферты',
          ua: 'Договір оферти',
        },
      },
      {
        name: 'services',
        text: {
          ru: 'Сервисы',
          ua: 'Сервіси',
        },
      },
      {
        name: 'contracts',
        text: {
          ru: 'Договора сотрудничества',
          ua: 'Договори співпраці',
        },
      },
      {
        name: 'partnerPrograms',
        text: {
          ru: 'Партнерские программы',
          ua: 'Партнерські програми',
        },
      },
    ],
    socialTitle: {
      ru: 'Присоединяйтесь к нам:',
      ua: 'Приєднуйся до нас:',
    },
    rulesText: {
      ru: '2019 Alcotec.com.ua. Все права защищены',
      ua: '2019 Alcotec.com.ua. Усі права захищені',
    },
    devTitle: {
      ru: 'Разработка сайта:',
      ua: 'Розробка сайту:',
    },
    footnote: {
      ru: '* Цены в валюте указаны в качестве индикативных. Оплата товара производится в национальной валюте по курсу на день оплаты.',
      ua: '* Ціни у валюті вказані в якості індикативних. Оплата товару проводиться в національній валюті за курсом на день оплати.',
    },
  },
  editPage: {
    title: {
      ru: 'Редактировать профиль',
      ua: 'Редагування профілю',
    },
    saveBtn: {
      ru: 'Сохранить изменения',
      ua: 'Зберегти зміни',
    },
    generalTitle: {
      ru: 'Основные данные',
      ua: 'Основні дані',
    },
    partner: {
      ru: 'Контрагент',
      ua: 'Контрагент',
    },
    fullName: {
      ru: 'ФИО',
      ua: 'ПІБ',
    },
    phone: {
      ru: 'Телефон',
      ua: 'Телефон',
    },
    email: {
      ru: 'Ваша электронная почта',
      ua: 'Ваша електронна пошта',
    },
    address: {
      ru: 'Адрес',
      ua: 'Адреса',
    },
    minMarga: {
      ru: 'Минимальная маржа, %',
      ua: 'Мінімальна маржа, %',
    },
    manager: {
      ru: 'Ваш персональный менеджер',
      ua: 'Ваш персональний менеджер',
    },
    optionProfile: {
      ru: 'Настройка профиля',
      ua: 'Настроювання профілю',
    },
    oldPassword: {
      ru: 'Старый пароль',
      ua: 'Старий пароль',
      text: {
        ru: 'Для смены пароля вначале введите старый пароль, потом новый',
        ua: 'Для зміни паролю спочатку введіть старий пароль, потім новий',
      },
    },
    newPassword: {
      ru: 'Новый пароль',
      ua: 'Новий пароль',
    },
    newPasswordAgain: {
      ru: 'Новый пароль еще раз',
      ua: 'Новий пароль ще раз',
    },
  },
  socialBlock: {
    text: {
      ua: 'Ставайте нашими клієнтами та вступайте до клубу архітекторів',
      ru: 'Становитесь нашими клиентами и вступайте в клуб архитекторов',
    },
    joinUs: {
      ru: 'Присоединяйтесь к нам',
      ua: 'Приєднуйтесь до нас',
    },
  },
  videosBlock: {
    title: {
      ua: 'Відео-огляди',
      ru: 'Видео-обзоры',
    },
    showAll: {
      ua: 'Побачити усі',
      ru: 'Посмотреть все',
    },
    text: {
      ua: 'ASKO - шведське якість за ексклюзивними цінами',
      ru: 'ASKO - шведское качество по эксклюзивным ценам',
    },
  },
  userMenu: [
    {
      name: 'projects',
      path: '/profile/projects',
      text: {
        ru: 'Проекты',
        ua: 'Проекти',
      },
    },
    {
      name: 'orders',
      path: '/profile/orders',
      text: {
        ru: 'Заказы поставщику',
        ua: 'Замовлення постачальнику',
      },
    },
    {
      name: 'training',
      path: '/profile/training',
      text: {
        ru: 'Обучение',
        ua: 'Навчання',
      },
    },
    {
      name: 'personalPromo',
      path: '/profile/promo',
      text: {
        ru: 'Персональные акции',
        ua: 'Персональні акції',
      },
    },
    {
      name: 'configurator',
      path: '/profile/configurator',
      text: {
        ru: 'Конфигуратор',
        ua: 'Конфігуратор',
      },
    },
    {
      name: 'edit',
      path: '/profile/edit',
      text: {
        ru: 'Редактировать профиль',
        ua: 'Редагування профілю',
      },
    },
  ],
  project: {
    titleProject: {
      ru: 'Товары в проекте №',
      ua: 'Товари у проекті №',
    },
    titleSpecification: {
      ru: 'Спецификации по проекту:',
      ua: 'Специфікації за проектом:',
    },
    titleSpecifications: {
      1: {
        title: {
          ru: 'Полная',
          ua: 'Повна',
        },
        url: 'pdf-full',
        params: '',
      },
      2: {
        title: {
          ru: 'Краткая',
          ua: 'Коротка',
        },
        url: 'pdf-min',
        params: '',
      },
      3: {
        title: {
          ru: 'Полная без цены',
          ua: 'Повна без ціни',
        },
        url: 'pdf-full',
        params: 'noprice=1',
      },
      4: {
        title: {
          ru: 'Краткая без цены',
          ua: 'Коротка без ціни',
        },
        url: 'pdf-min',
        params: 'noprice=1',
      },
    },
    commentProject: {
      ru: 'Комментарий к проекту',
      ua: 'Коментарій до проекту',
    },
    titlePrintSpecification: {
      ru: 'Заголовок для печати спецификации',
      ua: 'Заголовок для друку специфікації',
    },
    errorText: {
      ru: 'Недопустимый размер скидки',
      ua: 'Неприпустимий розмір знижки',
    },
    titleAddProject: {
      ru: 'Добавить в проект еще один товар',
      ua: 'Додати до проекту ще один товар',
    },
    titleSum: {
      ru: 'Сумма:',
      ua: 'Сума:',
    },
    titleDiscount: {
      ru: 'Скидка:',
      ua: 'Знижка:',
    },
    titlePurchase: {
      ru: 'Общая сумма закупки:',
      ua: 'Загальна сума закупівлі:',
    },
    titleMargin: {
      ru: 'Общая маржа:',
      ua: 'Загальна маржа:',
    },
    titleTotalProject: {
      ru: 'Общая сумма проекта:',
      ua: 'Загальна сума проекту:',
    },
    titleButtonWithMargin: {
      ru: 'Убрать проверку',
      ua: 'Видалити перевірку',
    },
    titleButtonWithoutMargin: {
      ru: 'Проверить проект',
      ua: 'Перевірити проект',
    },
    titleDelivery: {
      ru: 'Доставка:',
      ua: 'Доставка:',
    },
    titleCity: {
      ru: 'Город:',
      ua: 'Місто:',
    },
    titlePostcode: {
      ru: 'Номер отделения:',
      ua: 'Номер відділення:',
    },
    titleConnection: {
      ru: 'Подключение:',
      ua: 'Підключення:',
    },
    titleCount: {
      ru: 'единиц товара',
      ua: 'одиниць товару',
    },
    titleTotal: {
      ru: 'ИТОГО:',
      ua: 'ВСЬОГО:',
    },
    titleProjectOrder: {
      ru: 'Оформление проекта №',
      ua: 'Оформлення проекту №',
    },
    titleProjectClientName: {
      ru: 'Покупатель',
      ua: 'Покупець',
    },
    titleProjectClientPhone: {
      ru: 'Телефон',
      ua: 'Телефон',
    },
    titleProjectClientEmail: {
      ru: 'Ваша электронная почта',
      ua: 'Ваша електронна пошта',
    },
    titleProjectOrderDate: {
      ru: 'Заказ на дату',
      ua: 'Замовлення на дату',
    },
    titleProjectDelivery: {
      ru: 'Доставка',
      ua: 'Доставка',
    },
    titleProjectDeliveryLink: {
      ru: 'Посмотреть условия',
      ua: 'Переглянути умови',
    },
    titleProjectOrderComment: {
      ru: 'Комментарии к заказу',
      ua: 'Коментарі до замовлення',
    },
    titleProjectButtonSave: {
      ru: 'Сохранить',
      ua: 'Зберегти',
    },
    titleProjectButtonSaveChanges: {
      ru: 'Сохранить изменения',
      ua: 'Зберегти зміни',
    },
    titleProjectButtonSaveNewProject: {
      ru: 'Сохранить как новый проект',
      ua: 'Зберегти як новий проект',
    },
    titleProjectButtonCheckout: {
      ru: 'Оформить заказ',
      ua: 'Оформити замовлення',
    },
    titleProjectOrderDesc: {
      ru: 'После оформления заказа выбраные в нем товары и его заказ на дату — изменениям не подлежат',
      ua: 'Після оформлення замовлення обрані в ньому товари та його замовлення на дату - змінам не підлягають',
    },
  },
  projects: {
    placeholder: {
      ru: 'Номер проекта, заказа или имя клиента',
      ua: 'Номер проекту, заказу або им`я клієнта',
    },
    title: {
      ru: 'Проекты',
      ua: 'Проекти'
    },
    notification: {
      desc: {
        ru: 'У вас есть наступившие заказы.',
        ua: 'У вас є замовлення, що настали.'
      },
      link: {
        ru: 'Перейти в заказы',
        ua: 'Перейти до замовлень'
      }
    },
    order: {
      ru: 'ЗАЯВКА',
      ua: 'ЗАМОВЛЕННЯ'
    },
    th: [
      {
        ru: '№ Проекта',
        ua: '№ Проекту'
      },
      {
        ru: '№ Заказа',
        ua: '№ Замовлення'
      },
      {
        ru: 'Дата проекта',
        ua: 'Дата проекту'
      },
      {
        ru: 'Клиент',
        ua: 'Клієнт'
      },
      {
        ru: 'Товар',
        ua: 'Товар'
      },
      {
        ru: 'Сумма проекта',
        ua: 'Сума проекту'
      },
      {
        ru: 'Комментарий',
        ua: 'Коментарій'
      },
    ]
  },
  orders: {
    title: {
      ru: 'Заказы поставщику',
      ua: 'Замовлення постачальнику',
    },
    th: [
      {
        ru: '№ Проекта',
        ua: '№ Проекту',
      },
      {
        ru: '№ Заказа',
        ua: '№ Замовлення',
      },
      {
        ru: 'Сумма заказа, грн.',
        ua: 'Сума замовлення, грн.',
      },
      {
        ru: 'Сумма закупки, грн.',
        ua: 'Сума закупівлі, грн.',
      },
      {
        ru: 'Заказ на дату',
        ua: 'Замовлення на дату',
      },
      {
        ru: 'Статус заказа',
        ua: 'Статус замовлення',
      },
      {
        ru: 'Комментарий',
        ua: 'Коментарій',
      },
      {
        ru: 'Оплачено',
        ua: 'Сплачено',
      },
      {
        ru: 'Вознаграждение, грн.',
        ua: 'Винагорода, грн.',
      },
    ],
  },
  product: {
    recomPrice: {
      ru: 'Рекомендованная розничная цена',
      ua: 'Рекомендована роздрібна ціна',
    },
    selectCurrency: {
      ru: ['Гривна', 'Доллар', 'Евро'],
      ua: ['Гривня', 'Долар', 'Євро'],
    },
    buttons: {
      buy: {
        ru: 'Купить',
        ua: 'Купити',
      },
      addСomparison: {
        ru: 'Добавить к сравнению',
        ua: 'Додати до порівняння',
      },
      addInProject: {
        ru: 'Добавить в проект',
        ua: 'Додати до проекту',
      },
    },
    otherModel: {
      ru: 'Другие модели',
      ua: 'Інші моделі',
    },
    itemsFromCollection: {
      ru: 'Товары из этой коллекции',
      ua: 'Товари з цієї колекції',
    },
  },
  categoryItem: {
    subTitle: {
      ru: 'Рекомендованная розничная цена',
      ua: 'Рекомендована роздрібна ціна',
    },
    btn: {
      ru: 'Добавить в проект',
      ua: 'Додати до проекту',
    },
    checkbox: {
      ru: 'Добавить к сравнению',
      ua: 'Додати до порівняння',
    },
    activeCheckbox: {
      ru: 'Добавлен к сравнению',
      ua: 'Доданий до порівняння',
    },
  },
  comparison: {
    titleText: {
      ru: 'Сравнение товаров',
      ua: 'Порівняння товарів',
    },
    addedProduct: {
      ru: 'Добавить к сравнению еще один товар',
      ua: 'Додати до порівняння ще один товар',
    },
    clearList: {
      ru: 'Очистить список',
      ua: 'Очистити список',
    },
    ViewForPrinting: {
      ru: 'Вид для печати',
      ua: 'Вид для друку',
    },
    checkBoxAllFields: {
      ru: 'Все поля',
      ua: 'Усі поля',
    },
    checkBoxProductDifferences: {
      ru: 'Различия в товарах',
      ua: 'Відмінності у товарах',
    },
  },
  review: {
    sticker: {
      ru: 'Отзыв',
      ua: 'Відгук',
    },
    reviewTitle: {
      ru: 'Тестирование функционала',
      ua: 'Тестування функціоналу',
    },
    chooseTitle: {
      ru: 'Выберите вариант',
      ua: 'Виберіть варіант',
    },
    chooseOption: {
      ru: [
        'Отзыв',
        'Пожелания',
        'Ошибка',
      ],
      ua: [
        'Відгук',
        'Побажання',
        'Помилка',
      ],
    },
    moreDetailTitle: {
      ru: 'Опишите подробнее',
      ua: 'Опишіть детальніше',
    },
    submit: {
      ru: 'Отправить',
      ua: 'Відправити',
    },
    success: {
      ru: 'Спасибо за Ваш отзыв!',
      ua: 'Дякуємо за Ваш відгук!',
    },
  },
  fastBuy: {
    btn: {
      ru: 'Купить без регистрации',
      ua: 'Купити без реєстрації',
    },
    errorPhone: {
      length: {
        ru: 'Некорректный номер',
        ua: 'Некоректний номер',
      },
    },
    success: {
      ru: 'Спасибо, менеджер с Вами свяжется!',
      ua: 'Дякуємо, менеджер з Вами зв`яжеться!',
    },
  },
  guestBuy: {
    title: {
      ru: 'Оформление заказа на сумму',
      ua: 'Оформлення замовлення на суму',
    },
    btn: {
      ru: 'Оформить',
      ua: 'Оформити',
    },
    text: {
      ru: 'Коментарий',
      ua: 'Коментар',
    },
    address: {
      ru: 'Адрес доставки',
      ua: 'Адреса доставки',
    },
    email: {
      ru: 'E-mail',
      ua: 'E-mail',
    },
    phone: {
      ru: 'Телефон',
      ua: 'Телефон',
    },
    name: {
      ru: 'ФИО',
      ua: 'ПІБ',
    },
    emptyBasket: {
      ru: 'У вас пока не добавлено ни одного товара в корзину',
      ua: 'У вас поки не додано ні одного товару в кошик',
    },
    inBasket: {
      ru: 'В корзине',
      ua: 'В кошику',
    },
  },
};
