import React from "react";
import './ContentCardAside.scss';
import Picture1 from "../../../img/Picture.svg";
import Picture2 from "../../../img/Picture-2.svg";
import Picture3 from "../../../img/Picture-3.svg";
import Picture4 from "../../../img/Picture-4.svg";
import Collapse from "@kunukn/react-collapse/dist/Collapse.umd";

const ContentCardAside = ({elem, isShowNextTab}) => {
  const {bedroom, floors, metres, logCost, turnkeyCost, guarantee, photo} = elem;
  
  return (
    <>
      <div className={`aside-content-card d-flex overflow-hidden ${isShowNextTab ? 'show-next-tab': ''}`}>
        <div className="turnkeyсost-section">
          <div>
            <div className="aside-content-container">
              <ul className="item-details d-flex justify-content-between flex-wrap flex-xxl-nowrap">
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Цена</span>
                  <span className="title title-sm">{turnkeyCost} &#8381;</span>
                </li>
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Площадь</span>
                  <span className="title title-sm">{metres} м2</span>
                </li>
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Этажей</span>
                  <span className="title title-sm">{floors}</span>
                </li>
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Комнаты</span>
                  <span className="title title-sm">{bedroom ? bedroom : '-'}</span>
                </li>
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Гарантия</span>
                  <span className="title title-sm">{guarantee} лет</span>
                </li>
              </ul>
            </div>
    
            <div className="img-container-big">
              <img src={photo} alt="" className="img"/>
            </div>
  
            <div className="aside-content-container">
              <div className="main-desc">
                <p className="paragraph">Друзья, все наши проекты уникальны. Все предоставленные расчеты имеют
                  ознакомительный характер и основаны на нашем опыте работы с конкретным заказчиком и его
                  пожеланиями</p>
                <p className="paragraph text-color-blackgray">Вы можете ориентироваться на указанные цифры, но не
                  забывайте, что строительство деревянного дома — сложный и многогранный процесс. Он состоит из
                  множества работ, материалов и технологий, которые меняются на усмотрение заказчика. Поэтому ваш дом
                  может стоить чуть больше или чуть меньше обозначенной суммы.</p>
              </div>
            </div>
          </div>
  
          <div>
            <div className="aside-content-container"><h3 className='title title-secondary info-title'>Подготовительные работы</h3></div>
    
            <div className="img-container-small">
              <img src={Picture1} alt="" className="img"/>
            </div>
  
            <div className="aside-content-container">
              <ul className="list-info d-flex flex-column">
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">01</span>
                  <h4 className="title title-lg item-title">Необходимые изыскания</h4>
                  <p className="text-color-blackgray">Мы все делаем правильно. Поэтому, прежде чем приступить к
                    проектированию и строительству, проводим все необходимые изыскания, геологию, замеры и
                    топографическую съемку и привязкой объектов.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">02</span>
                  <h4 className="title title-lg item-title">Проектная документация</h4>
                  <p className="text-color-blackgray">До начала работ мы подготовим для вас полный пакет проектной
                    документации. Он состоит из архитектурного, инженерного, рабочего, ландшафтного и дизайн-проектов.
                    Это ваш гарант отсутствия ошибок при строительстве и соблюдения всех нормативов.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">03</span>
                  <h4 className="title title-lg item-title">Исполнение проектировки</h4>
                  <p className="text-color-blackgray">После того, как работы будут закончены, вы получите такой же
                    объемный пакет исполнительных документов, где зафиксировано фактическое исполнение проектных
                    решений, которые нужны в период эксплуатации здания.</p>
                </li>
              </ul>
            </div>
          </div>
  
          <div>
            <div className="aside-content-container"><h3 className='title title-secondary info-title'>Плотницкая работа</h3></div>
    
            <div className="img-container-small">
              <img src={Picture2} alt="" className="img"/>
            </div>
  
            <div className="aside-content-container">
              <ul className="list-info d-flex flex-column">
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">01</span>
                  <h4 className="title title-lg item-title">Изготовление и монтаж сруба</h4>
                  <p className="text-color-blackgray">На основании утвержденного проекта мы изготовим сруб вашего
                    будущего дома. Все работы на этом этапе ведутся на производственной базе Woodland. Вы в любой момент
                    сможете посетить производство и увидеть все своими глазами.</p>
                </li>
              </ul>
            </div>
          </div>
  
          <div>
            <div className="aside-content-container"><h3 className='title title-secondary info-title'>Общестроительные работы</h3></div>
    
            <div className="img-container-small">
              <img src={Picture3} alt="" className="img"/>
            </div>
  
            <div className="aside-content-container">
              <ul className="list-info d-flex flex-column">
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">01</span>
                  <h4 className="title title-lg item-title">Устройство фундамента</h4>
                  <p className="text-color-blackgray">Для фундамента этого проекта мы выбрали утепленную шведскую плиту.
                    Несмотря на изначально высокую стоимость материалов и работ по этому типу фундамента, в конечном
                    расчете он получится дешевле других видов.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">02</span>
                  <h4 className="title title-lg item-title">Устройство кровли</h4>
                  <p className="text-color-blackgray">Нам нравится ручная работа. Для данного проекта мы использовали
                    фальцевую кровлю ручной работы. Материал медь 0,3 мм. Пирог кровли с утеплением 250 мм, утеплитель
                    Parock, гидро и пароизоляционные пленки немецкие Delta.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">03</span>
                  <h4 className="title title-lg item-title">Устройство черновых перегородок</h4>
                  <p className="text-color-blackgray">На основе проектной документации и теплового расчета мы
                    изготавливаем деревянный каркас с утеплением, с паро и гидро - изоляционными пленками Delta и
                    шумоизоляцией. Каркас изготавливается под отделку, с конечным покрытием ОСБ.</p>
                </li>
              </ul>
            </div>
          </div>
  
          <div>
            <div className="aside-content-container"><h3 className='title title-secondary info-title'>Инженерные системы</h3></div>
    
            <div className="img-container-small">
              <img src={Picture4} alt="" className="img"/>
            </div>
  
            <div className="aside-content-container">
              <div className="second-desc">
                <p className="paragraph">Мы очень тщательно подходим к выполнению инженерных работ. В стоимость
                  включены: ОВК система, Вентиляция и кондиционирование, Электроснабжение, слаботочные сети, пожарная
                  сигнализация. Все системы объединены в одну систему управления, на основе протокола автоматизации
                  KNX.</p>
              </div>
            </div>
  
            <div className="aside-content-container">
              <ul className="list-info-secondary d-flex flex-wrap no-gutters">
                <li className="list-item d-flex flex-column col-12 col-md-6">
                  <div className="item-icon">
                    <svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M40.3167 23.2334H39.6333V21.1834C39.6315 19.8265 38.827 18.5992 37.5833 18.0565V7.51673C37.5832 7.24511 37.4222 6.99945 37.1733 6.8908C37.4399 6.46354 37.5819 5.97035 37.5833 5.46673C37.5833 3.95716 36.3596 2.7334 34.85 2.7334C33.3404 2.7334 32.1167 3.95716 32.1167 5.46673C32.1195 5.94797 32.2507 6.41973 32.4966 6.8334H8.5034C8.74932 6.41973 8.88052 5.94797 8.88333 5.46673C8.88333 3.95716 7.65957 2.7334 6.15 2.7334C4.64043 2.7334 3.41667 3.95716 3.41667 5.46673C3.41812 5.97035 3.56008 6.46354 3.82667 6.8908C3.57776 6.99945 3.41684 7.24511 3.41667 7.51673V18.0565C2.173 18.5992 1.36846 19.8265 1.36667 21.1834V23.2334H0.683333C0.305962 23.2334 0 23.5394 0 23.9167V33.4834C0 33.8608 0.305962 34.1667 0.683333 34.1667H1.36667V37.5834C1.36667 37.9608 1.67263 38.2667 2.05 38.2667H4.78333C5.1607 38.2667 5.46667 37.9608 5.46667 37.5834V34.1667H35.5333V37.5834C35.5333 37.9608 35.8393 38.2667 36.2167 38.2667H38.95C39.3274 38.2667 39.6333 37.9608 39.6333 37.5834V34.1667H40.3167C40.694 34.1667 41 33.8608 41 33.4834V23.9167C41 23.5394 40.694 23.2334 40.3167 23.2334ZM34.85 4.10007C35.6048 4.10007 36.2167 4.7119 36.2167 5.46673C36.2167 6.22156 35.6048 6.8334 34.85 6.8334C34.0952 6.8334 33.4833 6.22156 33.4833 5.46673C33.4833 4.7119 34.0952 4.10007 34.85 4.10007ZM6.15 4.10007C6.90483 4.10007 7.51667 4.7119 7.51667 5.46673C7.51667 6.22156 6.90483 6.8334 6.15 6.8334C5.39517 6.8334 4.78333 6.22156 4.78333 5.46673C4.78333 4.7119 5.39517 4.10007 6.15 4.10007ZM4.78333 8.20007H36.2167V17.7667H33.4656C33.9178 17.1788 34.1642 16.4585 34.1667 15.7167V14.3501C34.1644 12.4641 32.636 10.9356 30.75 10.9334H25.2833C23.3973 10.9356 21.8689 12.4641 21.8667 14.3501V15.7167C21.8691 16.4585 22.1156 17.1788 22.5678 17.7667H18.4322C18.8844 17.1788 19.1309 16.4585 19.1333 15.7167V14.3501C19.1311 12.4641 17.6027 10.9356 15.7167 10.9334H10.25C8.364 10.9356 6.83555 12.4641 6.83333 14.3501V15.7167C6.83581 16.4585 7.08224 17.1788 7.53443 17.7667H4.78333V8.20007ZM32.8 14.3501V15.7167C32.8 16.8489 31.8822 17.7667 30.75 17.7667H25.2833C24.1511 17.7667 23.2333 16.8489 23.2333 15.7167V14.3501C23.2333 13.2179 24.1511 12.3001 25.2833 12.3001H30.75C31.8822 12.3001 32.8 13.2179 32.8 14.3501ZM17.7667 14.3501V15.7167C17.7667 16.8489 16.8489 17.7667 15.7167 17.7667H10.25C9.1178 17.7667 8.2 16.8489 8.2 15.7167V14.3501C8.2 13.2179 9.1178 12.3001 10.25 12.3001H15.7167C16.8489 12.3001 17.7667 13.2179 17.7667 14.3501ZM2.73333 21.1834C2.73333 20.0512 3.65114 19.1334 4.78333 19.1334H36.2167C37.3489 19.1334 38.2667 20.0512 38.2667 21.1834V23.2334H2.73333V21.1834ZM4.1 36.9001H2.73333V34.1667H4.1V36.9001ZM38.2667 36.9001H36.9V34.1667H38.2667V36.9001ZM39.6333 32.8001H1.36667V24.6001H39.6333V32.8001Z"
                        fill="#352929"/>
                    </svg>
                  </div>
                  <h4 className="title title-lg item-title">Устройство черновых полов</h4>
                  <p className="text-color-blackgray">На основе проектной документации мы производим устройство полов и
                    перекрытий под финишное покрытие полов. Пирог полов состоит из утепления, шумоизоляции,
                    гидроизоляции Delta.</p>
                </li>
                <li className="list-item d-flex flex-column col-12 col-md-6">
                  <div className="item-icon">
                    <svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <g clipPath="url(#clip0)">
                        <path
                          d="M40.5693 18.8889L17.4044 5.64005C15.6176 4.61649 13.1719 5.16831 11.9941 6.85394L7.50646 13.2693C7.06604 13.8996 6.83333 14.6385 6.83333 15.4074C6.83333 16.7357 7.54738 17.973 8.69594 18.6359L13.5815 21.4573L12.6989 22.635C12.2209 23.272 11.9582 24.0618 11.9582 24.8583C11.9582 25.6774 12.2582 26.4479 12.7414 27.0849L11.4411 29.0414H5.12496V26.4705C5.12496 25.998 4.74291 25.6248 4.27077 25.6248H0.854187C0.38205 25.6248 0 25.998 0 26.4705V35.0198C0 35.4924 0.38205 35.8747 0.854187 35.8747H4.27085C4.74299 35.8747 5.12504 35.4924 5.12504 35.0198V34.1665H11.4412C13.1587 34.1665 14.7527 33.3133 15.7053 31.8832L17.1054 29.7812C17.375 29.8397 17.6469 29.8928 17.9249 29.8928C19.2845 29.8928 20.5641 29.1681 21.2631 28.001L22.2016 26.4354L29.4711 30.6334C29.602 30.7094 29.7497 30.7478 29.8981 30.7478C29.9807 30.7478 30.0633 30.7361 30.1442 30.7119C30.3695 30.6434 30.5571 30.4856 30.6622 30.2752L31.2946 29.0077C31.3984 29.0155 31.4982 29.038 31.6039 29.038C34.9005 29.038 37.5831 26.353 37.5831 23.0535C37.5831 22.6911 37.5296 22.3177 37.4501 21.936L40.5276 20.396C40.8096 20.2549 40.9905 19.9702 40.9998 19.6546C41.008 19.3397 40.8429 19.045 40.5693 18.8889ZM3.41667 34.1665H1.70829V27.3332H3.41659V34.1665H3.41667ZM14.2838 30.9392C13.649 31.8918 12.5863 32.4606 11.4411 32.4606H5.12496V30.7523H11.4411C12.015 30.7523 12.5463 30.4679 12.8624 29.9916L14.0453 28.2168L15.5121 29.0967L14.2838 30.9392ZM19.7984 27.1288C19.2011 28.1222 17.7956 28.4759 16.8013 27.8778L14.635 26.5782C14.0378 26.2204 13.6666 25.5648 13.6666 24.8683C13.6666 24.4395 13.8084 24.0149 14.0653 23.6713L15.0714 22.3299L20.7217 25.5899L19.7984 27.1288ZM29.5394 28.7053L9.54924 17.1716C8.92784 16.8129 8.54163 16.144 8.54163 15.4258C8.54163 15.0095 8.66759 14.6099 8.90614 14.2688L11.0507 11.2058L32.1885 23.4004L29.5394 28.7053ZM32.1607 27.2793L33.9487 23.6987L35.8461 22.7501C35.8557 22.8549 35.8747 22.9634 35.8747 23.0648C35.8747 25.2289 34.2505 27.003 32.1607 27.2793ZM33.3412 22.0928L12.0344 9.80087L13.3938 7.85931C13.8435 7.21701 14.5791 6.83328 15.3633 6.83328C15.7812 6.83328 16.1941 6.94259 16.5569 7.15023L38.3363 19.5956L33.3412 22.0928Z"
                          fill="#352929"/>
                        <path
                          d="M28.1876 25.6254C28.6593 25.6254 29.0417 25.2429 29.0417 24.7712C29.0417 24.2994 28.6593 23.917 28.1876 23.917C27.7158 23.917 27.3334 24.2994 27.3334 24.7712C27.3334 25.2429 27.7158 25.6254 28.1876 25.6254Z"
                          fill="#352929"/>
                      </g>
                      <defs>
                        <clipPath id="clip0">
                          <rect width="41" height="41" fill="#352929"/>
                        </clipPath>
                      </defs>
                    </svg>
                  </div>
                  <h4 className="title title-lg item-title">Устройство веранд и террас</h4>
                  <p className="text-color-blackgray">На основе проектной документации мы производим устройство полов и
                    перекрытий под финишное покрытие полов. Пирог полов состоит из утепления, шумоизоляции,
                    гидроизоляции Delta.</p>
                </li>
                <li className="list-item d-flex flex-column col-12 col-md-6">
                  <div className="item-icon">
                    <svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M35.875 25.6254H35.0208V24.7712C35.0208 24.299 34.6387 23.917 34.1666 23.917C33.6944 23.917 33.3124 24.299 33.3124 24.7712V25.6254H32.4582C31.9861 25.6254 31.604 26.0074 31.604 26.4796C31.604 26.9517 31.9861 27.3338 32.4582 27.3338H33.3124V28.188C33.3124 28.6601 33.6944 29.0422 34.1666 29.0422C34.6387 29.0422 35.0208 28.6601 35.0208 28.188V27.3338H35.875C36.3471 27.3338 36.7292 26.9517 36.7292 26.4796C36.7291 26.0074 36.3471 25.6254 35.875 25.6254Z"
                        fill="#352929"/>
                      <path
                        d="M35.8749 32.459H32.4582C31.9861 32.459 31.604 32.841 31.604 33.3132C31.604 33.7853 31.9861 34.1674 32.4582 34.1674H35.8749C36.347 34.1674 36.7291 33.7853 36.7291 33.3132C36.7291 32.841 36.347 32.459 35.8749 32.459Z"
                        fill="#352929"/>
                      <path
                        d="M37.5833 20.5002H35.875V10.2502H36.7292C37.1413 10.2502 37.495 9.95571 37.5692 9.55027C37.6434 9.14484 37.4182 8.74445 37.0336 8.59766L19.0961 1.76434C18.8993 1.68923 18.684 1.68923 18.4872 1.76434L0.549642 8.59766C0.165106 8.74445 -0.0601538 9.14484 0.0140787 9.55027C0.0883113 9.95571 0.442017 10.2502 0.8541 10.2502H1.70829V29.0419C1.70829 30.9262 3.24059 32.4586 5.12499 32.4586H27.3333C27.3333 36.2264 30.3988 39.2919 34.1667 39.2919C37.9345 39.2919 41 36.2264 41 32.4586V23.9169C41 22.0325 39.4676 20.5002 37.5833 20.5002ZM6.83322 14.521V30.7502H5.12492C4.18319 30.7502 3.4166 29.9836 3.4166 29.0419V9.39596C3.4166 9.37514 3.4158 9.35512 3.41412 9.33422L18.7916 3.47682L34.1691 9.33422C34.1675 9.35504 34.1667 9.37506 34.1667 9.39596V20.5002H30.75V14.521C30.75 14.0488 30.3679 13.6668 29.8958 13.6668H7.68742C7.21528 13.6669 6.83322 14.0489 6.83322 14.521ZM8.54153 17.0835V15.3752H29.0416V17.0835H8.54153ZM29.0416 18.7919V20.5002H8.54153V18.7919H29.0416ZM27.3333 30.7502H8.54153V25.6252H27.3333V30.7502ZM27.3333 23.9169H8.54153V22.2086H27.8084C27.5142 22.7131 27.3333 23.2918 27.3333 23.9169ZM39.2916 32.4585C39.2916 35.2846 36.9927 37.5835 34.1666 37.5835C31.3405 37.5835 29.0416 35.2846 29.0416 32.4585V23.9169C29.0416 22.9752 29.8082 22.2086 30.7499 22.2086H37.5832C38.5249 22.2086 39.2915 22.9752 39.2915 23.9169L39.2916 32.4585Z"
                        fill="#352929"/>
                    </svg>
                  </div>
                  <h4 className="title title-lg item-title">Устройство окон</h4>
                  <p className="text-color-blackgray">На основе проектной документации мы производим устройство полов и
                    перекрытий под финишное покрытие полов. Пирог полов состоит из утепления, шумоизоляции,
                    гидроизоляции Delta.</p>
                </li>
                <li className="list-item d-flex flex-column col-12 col-md-6">
                  <div className="item-icon">
                    <svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M30.75 14.5212C30.75 14.049 30.368 13.667 29.8958 13.667H4.27082C3.79868 13.667 3.41663 14.049 3.41663 14.5212V17.9379C3.41663 18.41 3.79868 18.7921 4.27082 18.7921H29.8958C30.368 18.7921 30.75 18.41 30.75 17.9379V14.5212ZM29.0417 17.0837H5.12501V15.3754H29.0417V17.0837Z"
                        fill="#352929"/>
                      <path
                        d="M4.27082 10.2504H23.0625C23.5347 10.2504 23.9167 9.86833 23.9167 9.39619C23.9167 8.92404 23.5347 8.54199 23.0625 8.54199H4.27082C3.79868 8.54199 3.41663 8.92404 3.41663 9.39619C3.41671 9.86833 3.79876 10.2504 4.27082 10.2504Z"
                        fill="#352929"/>
                      <path
                        d="M29.0417 10.2506C29.9851 10.2506 30.75 9.48576 30.75 8.54229C30.75 7.59882 29.9851 6.83398 29.0417 6.83398C28.0982 6.83398 27.3334 7.59882 27.3334 8.54229C27.3334 9.48576 28.0982 10.2506 29.0417 10.2506Z"
                        fill="#352929"/>
                      <path
                        d="M23.9168 24.7712C23.9168 24.299 23.5347 23.917 23.0626 23.917C22.5904 23.917 22.2084 24.299 22.2084 24.7712C22.2084 26.311 22.7614 27.141 23.206 27.8075C23.603 28.4031 23.9167 28.8736 23.9167 29.8962C23.9167 30.3683 24.2987 30.7504 24.7709 30.7504C25.243 30.7504 25.6251 30.3683 25.6251 29.8962C25.6251 28.3564 25.072 27.5264 24.6275 26.8599C24.2303 26.2643 23.9168 25.7939 23.9168 24.7712Z"
                        fill="#352929"/>
                      <path
                        d="M9.39576 23.917C8.92362 23.917 8.54156 24.299 8.54156 24.7712C8.54156 25.7939 8.2279 26.2643 7.83087 26.8599C7.38627 27.5264 6.83325 28.3564 6.83325 29.8962C6.83325 30.3682 7.21531 30.7503 7.68745 30.7503C8.15959 30.7503 8.54164 30.3682 8.54164 29.8961C8.54164 28.8734 8.85531 28.403 9.25234 27.8074C9.69694 27.1409 10.25 26.3109 10.25 24.7711C10.25 24.299 9.8679 23.917 9.39576 23.917Z"
                        fill="#352929"/>
                      <path
                        d="M16.2292 23.917C15.7571 23.917 15.375 24.299 15.375 24.7712V29.8962C15.375 30.3683 15.7571 30.7504 16.2292 30.7504C16.7013 30.7504 17.0834 30.3683 17.0834 29.8962V24.7712C17.0833 24.299 16.7013 23.917 16.2292 23.917Z"
                        fill="#352929"/>
                      <path
                        d="M35.875 23.9174H35.0208V23.0632C35.0208 22.591 34.6388 22.209 34.1666 22.209C33.6945 22.209 33.3125 22.591 33.3125 23.0632V23.9174H32.4583C31.9862 23.9174 31.6041 24.2994 31.6041 24.7716C31.6041 25.2437 31.9862 25.6258 32.4583 25.6258H33.3125V26.4799C33.3125 26.9521 33.6946 27.3341 34.1667 27.3341C34.6388 27.3341 35.0209 26.9521 35.0209 26.4799V25.6257H35.875C36.3472 25.6257 36.7292 25.2436 36.7292 24.7715C36.7292 24.2994 36.3472 23.9174 35.875 23.9174Z"
                        fill="#352929"/>
                      <path
                        d="M35.875 30.75H32.4583C31.9862 30.75 31.6041 31.1321 31.6041 31.6042C31.6041 32.0763 31.9862 32.4584 32.4583 32.4584H35.875C36.3472 32.4584 36.7292 32.0763 36.7292 31.6042C36.7292 31.1321 36.3472 30.75 35.875 30.75Z"
                        fill="#352929"/>
                      <path
                        d="M37.5833 18.7921H34.1666V6.83369C34.1666 4.94937 32.6343 3.41699 30.7499 3.41699H3.41669C1.53229 3.41707 0 4.94937 0 6.83369V18.792C0 20.6763 1.53229 22.2087 3.41669 22.2087H27.3334V30.7504C27.3334 34.5182 30.3989 37.5837 34.1667 37.5837C37.9345 37.5837 41 34.5182 41 30.7504V22.2087C41 20.3244 39.4677 18.7921 37.5833 18.7921ZM27.8085 20.5004H3.41669C2.47497 20.5004 1.70839 19.7338 1.70839 18.7921V6.83369C1.70831 5.89197 2.47489 5.12538 3.41669 5.12538H30.75C31.6917 5.12538 32.4583 5.89197 32.4583 6.83369V18.792H30.75C29.4908 18.7921 28.4011 19.4841 27.8085 20.5004ZM39.2917 30.7504C39.2917 33.5765 36.9928 35.8754 34.1667 35.8754C31.3406 35.8754 29.0417 33.5765 29.0417 30.7504V22.2087C29.0417 21.267 29.8083 20.5004 30.75 20.5004H37.5833C38.525 20.5004 39.2916 21.267 39.2916 22.2087V30.7504H39.2917Z"
                        fill="#352929"/>
                    </svg>
                  </div>
                  <h4 className="title title-lg item-title">Отделка цоколя</h4>
                  <p className="text-color-blackgray">На основе проектной документации мы производим устройство полов и
                    перекрытий под финишное покрытие полов. Пирог полов состоит из утепления, шумоизоляции,
                    гидроизоляции Delta.</p>
                </li>
                <li className="list-item d-flex flex-column col-12 col-md-6">
                  <div className="item-icon">
                    <svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M35.875 27.3334H35.0208V26.4792C35.0208 26.0071 34.6388 25.625 34.1666 25.625C33.6945 25.625 33.3125 26.0071 33.3125 26.4793V27.3335H32.4583C31.9862 27.3335 31.6041 27.7155 31.6041 28.1877C31.6041 28.6598 31.9862 29.0419 32.4583 29.0419H33.3125V29.896C33.3125 30.3682 33.6946 30.7502 34.1667 30.7502C34.6388 30.7502 35.0209 30.3682 35.0209 29.896V29.0419H35.875C36.3472 29.0419 36.7292 28.6598 36.7292 28.1877C36.7292 27.7154 36.3472 27.3334 35.875 27.3334Z"
                        fill="#352929"/>
                      <path
                        d="M35.875 34.167H32.4583C31.9862 34.167 31.6041 34.549 31.6041 35.0212C31.6041 35.4933 31.9862 35.8754 32.4583 35.8754H35.875C36.3472 35.8754 36.7292 35.4933 36.7292 35.0212C36.7292 34.549 36.3472 34.167 35.875 34.167Z"
                        fill="#352929"/>
                      <path
                        d="M37.5833 22.2083H35.3543C35.6955 20.8116 35.875 19.3807 35.875 17.9375C35.875 8.04705 27.8288 0 17.9375 0C8.04617 0 0 8.04705 0 17.9375C0 27.8279 8.04617 35.875 17.9375 35.875C21.288 35.875 24.5029 34.9483 27.3333 33.1921V34.1667C27.3333 37.9345 30.398 41 34.1666 41C37.9352 41 41 37.9345 41 34.1667V25.625C41 23.7407 39.4668 22.2083 37.5833 22.2083ZM27.3333 25.625V31.1341C24.5643 33.1127 21.3281 34.1667 17.9375 34.1667C8.98877 34.1667 1.70831 26.8862 1.70831 17.9375C1.70831 8.98877 8.98877 1.70831 17.9375 1.70831C26.8862 1.70831 34.1667 8.98877 34.1667 17.9375C34.1667 19.3858 33.9404 20.8147 33.56 22.2083H30.75C30.5279 22.2083 30.312 22.2332 30.1015 22.2739C30.3997 21.45 30.6176 20.5954 30.7418 19.7108C30.7952 19.3297 30.5866 18.9593 30.2329 18.8075C27.4454 17.609 24.8745 17.347 23.3759 17.314C23.324 16.8697 23.2286 16.4408 23.0752 16.0352C23.1089 16.007 23.1397 15.9846 23.1744 15.9546C23.9368 15.2932 25.525 13.916 28.8282 13.2995C29.0951 13.2495 29.322 13.076 29.4405 12.8324C29.5589 12.5889 29.554 12.3036 29.4288 12.0634C28.5646 10.4134 27.3717 8.99373 25.8837 7.84421C25.585 7.61063 25.1679 7.60566 24.856 7.83084C22.4301 9.60785 20.917 11.6725 20.1317 12.9423C19.7248 12.766 19.2901 12.6485 18.8391 12.5741C18.8314 12.5293 18.8272 12.4895 18.8184 12.4429C18.6332 11.4561 18.2479 9.40237 19.3389 6.29854C19.429 6.04414 19.3924 5.76218 19.2422 5.5386C19.0921 5.31503 18.8452 5.17577 18.5765 5.1616L18.393 5.15078C16.6162 5.02066 14.7811 5.39022 13.0812 6.07168C12.7242 6.21518 12.5072 6.5797 12.5506 6.96175C12.8941 9.93401 13.9462 12.2694 14.6652 13.5783C14.3064 13.8437 13.9887 14.1533 13.7048 14.4957C13.6572 14.4788 13.6169 14.4609 13.5667 14.444C12.6074 14.1212 10.6088 13.4497 8.41661 10.9289C8.2414 10.7262 7.97114 10.6203 7.71256 10.6369C7.44566 10.6562 7.20207 10.7988 7.05688 11.024C6.04101 12.5873 5.39366 14.3206 5.13341 16.1758C5.08 16.557 5.2886 16.9265 5.64222 17.0791C8.42934 18.2779 11.0038 18.5363 12.5 18.5707C12.5528 19.015 12.6485 19.444 12.8027 19.8493C12.7682 19.8782 12.7363 19.9012 12.7008 19.9318C11.9384 20.5933 10.3502 21.9705 7.04696 22.5861C6.78005 22.6362 6.55311 22.8088 6.43468 23.0524C6.31792 23.2968 6.32121 23.5821 6.44637 23.8224C7.31057 25.4723 8.50342 26.8929 9.99151 28.0423C10.145 28.1616 10.3285 28.2208 10.5137 28.2208C10.6905 28.2208 10.8674 28.1657 11.0192 28.0556C13.4506 26.2745 14.9651 24.2043 15.7489 22.9355C16.1537 23.1104 16.586 23.2264 17.0343 23.3006C17.0426 23.3493 17.0472 23.3927 17.0568 23.4436C17.242 24.4304 17.6274 26.4841 16.5363 29.5879C16.4462 29.8423 16.4829 30.1243 16.633 30.3478C16.7832 30.5714 17.0301 30.7107 17.2987 30.7249L17.4823 30.7357C17.6324 30.7465 17.7842 30.7557 17.9377 30.7557C19.6044 30.7557 21.2376 30.4395 22.7942 29.8148C23.1511 29.6713 23.3681 29.3068 23.3247 28.9247C22.9805 25.9462 21.9244 23.6072 21.2055 22.3C21.563 22.0362 21.8796 21.7282 22.163 21.3878C22.213 21.4057 22.2556 21.4245 22.3086 21.4424C23.261 21.7629 25.2385 22.4316 27.412 24.9079C27.3622 25.1397 27.3333 25.3788 27.3333 25.625ZM18.7734 23.3303C18.8239 23.3221 18.8727 23.302 18.9229 23.2924C19.0825 23.2635 19.2338 23.2166 19.3884 23.1744C19.4911 23.1451 19.5955 23.1313 19.6977 23.0959C20.2916 24.1728 21.1558 26.0588 21.5361 28.4586C20.5501 28.7898 19.5325 28.9825 18.4981 29.0334C19.2472 26.2998 18.9669 24.3896 18.7734 23.3303ZM17.9375 21.6828C15.8455 21.6828 14.1438 20.0029 14.1438 17.9375C14.1438 15.8721 15.8455 14.1922 17.9375 14.1922C20.0295 14.1922 21.7312 15.8721 21.7312 17.9375C21.7312 20.0029 20.0295 21.6828 17.9375 21.6828ZM14.3074 22.024C13.6617 23.0733 12.4422 24.7542 10.532 26.2781C9.7596 25.6083 9.09063 24.8475 8.53505 24.0042C11.3144 23.2769 12.8326 22.0715 13.6567 21.3641C13.7252 21.4469 13.8111 21.5168 13.8849 21.5956C13.988 21.7078 14.0922 21.8162 14.2044 21.9196C14.2411 21.9527 14.2697 21.9918 14.3074 22.024ZM17.1018 12.5564C17.0771 12.5603 17.0534 12.5707 17.0287 12.575C16.7679 12.6184 16.5192 12.6883 16.2722 12.7669C16.2409 12.7771 16.2088 12.78 16.1775 12.7908C15.5836 11.7139 14.7195 9.82791 14.3391 7.42805C15.3251 7.09692 16.3427 6.90418 17.3771 6.85333C16.628 9.58687 16.9083 11.4971 17.1018 12.5564ZM21.612 13.9075C21.5961 13.8936 21.584 13.8765 21.5678 13.8626C22.2151 12.8124 23.433 11.1325 25.3432 9.60849C26.1156 10.2783 26.7846 11.0391 27.3402 11.8815C24.5608 12.6089 23.0426 13.8151 22.2186 14.5224C22.1684 14.4618 22.1044 14.4115 22.0514 14.353C21.9121 14.1963 21.7682 14.0475 21.612 13.9075ZM12.8043 15.989C12.7665 16.0887 12.7488 16.1968 12.717 16.299C12.6567 16.4874 12.5843 16.67 12.5447 16.8665C11.3038 16.8381 9.22564 16.6353 6.93517 15.7603C7.13536 14.7627 7.46905 13.8101 7.93278 12.9125C9.95651 14.9329 11.7683 15.6353 12.8043 15.989ZM27.9424 22.9741C25.9187 20.9538 24.107 20.2514 23.071 19.8977C23.1231 19.7597 23.151 19.6119 23.1915 19.469C23.2363 19.3185 23.2974 19.1755 23.3292 19.02C24.5699 19.0483 26.6472 19.251 28.9401 20.1263C28.7398 21.124 28.4061 22.0766 27.9424 22.9741ZM39.2917 34.1667C39.2917 36.9928 36.9928 39.2917 34.1667 39.2917C31.3406 39.2917 29.0417 36.9928 29.0417 34.1667V25.625C29.0417 24.6833 29.8075 23.9167 30.75 23.9167H37.5833C38.5259 23.9167 39.2916 24.6833 39.2916 25.625V34.1667H39.2917Z"
                        fill="#352929"/>
                    </svg>
                  </div>
                  <h4 className="title title-lg item-title">Устройство каркаса душевых</h4>
                  <p className="text-color-blackgray">На основе проектной документации мы производим устройство полов и
                    перекрытий под финишное покрытие полов. Пирог полов состоит из утепления, шумоизоляции,
                    гидроизоляции Delta.</p>
                </li>
              </ul>
            </div>
          </div>
  
          <div>
            <div className="aside-content-container">
              <h3 className='title title-secondary info-title'>Что не входит в стоимость, но необходимо вам до конечного результата?</h3>
              <ul className="list-info last d-flex flex-column">
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">01</span>
                  <h4 className="title title-lg item-title">Комплектация</h4>
                  <p className="text-color-blackgray">Мы не можем включить в стоимость комплектацию строения мебелью и
                    предметами интерьера. Так же если вы захотите особый пол к примеру массив или интересную метлахскую
                    плитку она не войдет в указанную стоимость, но мы можем ее привезти и уложить за дополнительные
                    деньги</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">02</span>
                  <h4 className="title title-lg item-title">Дополнительные столярные работы </h4>
                  <p className="text-color-blackgray">В деревянном домостроении возможно украсить дом различными
                    интересными фигурами и инсталляциями. Мы относим эту работу к комплектации и не можем ее включить в
                    указанную стоимость.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">03</span>
                  <h4 className="title title-lg item-title">Ландшафтные работы</h4>
                  <p className="text-color-blackgray">Пока мы не знакомы с вами и с вашим участком мы не сможем даже
                    примерно оценить этот вид работ. Но мы имеем опыт работы и считаем что хороший ландшафтный проект и
                    его реализация не только придают полноценности вашему строению и участку но и увеличивают его
                    ликвидность.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">04</span>
                  <h4 className="title title-lg item-title">Сервисное обслуживание</h4>
                  <p className="text-color-blackgray">Деревянное строение - сложный технический продукт, требующий
                    постоянного ухода и профессионального обслуживания. Мы имеем собственную сервисную команду
                    специалистов которая будет поддерживать ваше строение в идеальном состоянии</p>
                </li>
              </ul>
            </div>
          </div>
        </div>
        <div className="logcost-section">
          <div>
            <div className="aside-content-container">
              <ul className="item-details d-flex justify-content-between flex-wrap flex-xxl-nowrap">
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Цена</span>
                  <span className="title title-sm">{logCost} &#8381;</span>
                </li>
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Площадь</span>
                  <span className="title title-sm">{metres} м2</span>
                </li>
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Этажей</span>
                  <span className="title title-sm">{floors}</span>
                </li>
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Комнаты</span>
                  <span className="title title-sm">{bedroom ? bedroom : '-'}</span>
                </li>
                <li className="d-flex flex-column">
                  <span className="text-color-blackgray">Гарантия</span>
                  <span className="title title-sm">{guarantee} лет</span>
                </li>
              </ul>
            </div>
    
            <div className="img-container-big">
              <img src={photo} alt="" className="img"/>
            </div>
  
            <div className="aside-content-container">
              <div className="main-desc">
                <p className="paragraph">Друзья, все наши проекты уникальны. Все предоставленные расчеты имеют
                  ознакомительный характер и основаны на нашем опыте работы с конкретным заказчиком и его
                  пожеланиями</p>
                <p className="paragraph text-color-blackgray">Вы можете ориентироваться на указанные цифры, но не
                  забывайте, что строительство деревянного дома — сложный и многогранный процесс. Он состоит из
                  множества работ, материалов и технологий, которые меняются на усмотрение заказчика. Поэтому ваш дом
                  может стоить чуть больше или чуть меньше обозначенной суммы.</p>
              </div>
            </div>
          </div>
  
          <div>
            <div className="aside-content-container"><h3 className='title title-secondary info-title'>Подготовительные работы</h3></div>
    
            <div className="img-container-small">
              <img src={Picture1} alt="" className="img"/>
            </div>
  
            <div className="aside-content-container">
              <ul className="list-info d-flex flex-column">
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">01</span>
                  <h4 className="title title-lg item-title">Необходимые изыскания</h4>
                  <p className="text-color-blackgray">Мы все делаем правильно. Поэтому, прежде чем приступить к
                    проектированию и строительству, проводим все необходимые изыскания, геологию, замеры и
                    топографическую съемку и привязкой объектов.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">02</span>
                  <h4 className="title title-lg item-title">Проектная документация</h4>
                  <p className="text-color-blackgray">До начала работ мы подготовим для вас полный пакет проектной
                    документации. Он состоит из архитектурного, инженерного, рабочего, ландшафтного и дизайн-проектов.
                    Это ваш гарант отсутствия ошибок при строительстве и соблюдения всех нормативов.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">03</span>
                  <h4 className="title title-lg item-title">Исполнение проектировки</h4>
                  <p className="text-color-blackgray">После того, как работы будут закончены, вы получите такой же
                    объемный пакет исполнительных документов, где зафиксировано фактическое исполнение проектных
                    решений, которые нужны в период эксплуатации здания.</p>
                </li>
              </ul>
            </div>
          </div>
  
          <div>
            <div className="aside-content-container"><h3 className='title title-secondary info-title'>Изготовление сруба</h3></div>
    
            <div className="img-container-small">
              <img src={Picture2} alt="" className="img"/>
            </div>
  
            <div className="aside-content-container">
              <ul className="list-info d-flex flex-column">
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">01</span>
                  <h4 className="title title-lg item-title">Изготовление и монтаж сруба</h4>
                  <p className="text-color-blackgray">На основании утвержденного проекта мы изготовим сруб вашего
                    будущего дома. Все работы на этом этапе ведутся на производственной базе Woodland. Вы в любой момент
                    сможете посетить производство и увидеть все своими глазами.</p>
                </li>
              </ul>
            </div>
          </div>
  
          <div>
            <div className="aside-content-container"><h3 className='title title-secondary info-title'>Транспортировка сруба</h3></div>
    
            <div className="img-container-small">
              <img src={Picture3} alt="" className="img"/>
            </div>
  
            <div className="aside-content-container">
              <ul className="list-info d-flex flex-column">
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">01</span>
                  <h4 className="title title-lg item-title">Изготовление и монтаж сруба</h4>
                  <p className="text-color-blackgray">На основании утвержденного проекта мы изготовим сруб вашего
                    будущего дома. Все работы на этом этапе ведутся на производственной базе Woodland. Вы в любой момент
                    сможете посетить производство и увидеть все своими глазами.</p>
                </li>
              </ul>
            </div>
          </div>
  
          <div>
            <div className="aside-content-container"><h3 className='title title-secondary info-title'>Что не входит в стоимость, но
              необходимо вам до конечного результата?</h3></div>
  
            <div className="aside-content-container">
              <ul className="list-info last d-flex flex-column">
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">01</span>
                  <h4 className="title title-lg item-title">Комплектация</h4>
                  <p className="text-color-blackgray">Мы не можем включить в стоимость комплектацию строения мебелью и
                    предметами интерьера. Так же если вы захотите особый пол к примеру массив или интересную метлахскую
                    плитку она не войдет в указанную стоимость, но мы можем ее привезти и уложить за дополнительные
                    деньги</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">02</span>
                  <h4 className="title title-lg item-title">Дополнительные столярные работы </h4>
                  <p className="text-color-blackgray">В деревянном домостроении возможно украсить дом различными
                    интересными фигурами и инсталляциями. Мы относим эту работу к комплектации и не можем ее включить в
                    указанную стоимость.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">03</span>
                  <h4 className="title title-lg item-title">Ландшафтные работы</h4>
                  <p className="text-color-blackgray">Пока мы не знакомы с вами и с вашим участком мы не сможем даже
                    примерно оценить этот вид работ. Но мы имеем опыт работы и считаем что хороший ландшафтный проект и
                    его реализация не только придают полноценности вашему строению и участку но и увеличивают его
                    ликвидность.</p>
                </li>
                <li className="list-item d-flex flex-column">
                  <span className="title title-secondary item-counter">04</span>
                  <h4 className="title title-lg item-title">Сервисное обслуживание</h4>
                  <p className="text-color-blackgray">Деревянное строение - сложный технический продукт, требующий
                    постоянного ухода и профессионального обслуживания. Мы имеем собственную сервисную команду
                    специалистов которая будет поддерживать ваше строение в идеальном состоянии</p>
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </>
  );
};

export default ContentCardAside;