<template>
  <div class="delivery">
    <div class="custom-container">
      <h1 class="about_title">Доставка</h1>
      <p>
        Доставка по Киеву чаще всего осуществляется на следующий день после
        оформления заказа (а при доставке в другие города - после оплаты).<br />
        <br />
        <span><strong>Логистика &quot;Алкотек&quot; работает:</strong></span>
        <br />
        Понедельник - Пятница с 11.00 до 18.00;<br />
        Суббота - выходной;<br />
        Воскресенье - выходной.
      </p>

      <p>
        <span><strong>По Киеву доставка бесплатная</strong> </span> при сумме
        заказа свыше 5000 грн.<br />
        При меньшей сумме заказа доставка платная&nbsp; - 70 грн.
      </p>

      <p>
        <span>
          <strong>
            Занос бытовой техники и мебели в квартиру (офис) бесплатный
          </strong>
        </span>
        только при наличии лифта (грузового лифта для крупной техники).
      </p>

      <p>
        В случае отсутствия или неработоспособности лифта &nbsp;стоимость
        подъема
        <span><strong>мелкой бытовой техники</strong></span>
        &nbsp;вручную 25 грн./этаж до 5-ого этажа ( включая 1 и 5) и &nbsp;40
        грн. за этаж с 6-ого и выше.
      </p>

      <p>
        Крупной бытовой техники&nbsp;<em>
          (духовки, сушильные машины, стиральные машины, пусодомоечные машины,
          варочные поверхностти, вытяжки)
        </em>
        стоимость подьема вручную 40 грн&nbsp;до 5-ого этажа (включая 1 и
        5)&nbsp;и 50 грн за эатаж с 6-ого этажа и выше.
      </p>

      <p>
        Стоимость подьема крупно-габаритной техники
        <em>(холодильники, морозильные шкафы/лари, сушильные шкафы)</em>
        <span><strong>&nbsp;</strong></span>
        стоимость подьема вручную 50 грн&nbsp;до 5-ого этажа (включая 1 и
        5)&nbsp;и 100 грн за эатаж с 6-ого этажа и выше.&nbsp;
      </p>

      <p>
        Если техника негабаритная (например не помещается в двери
        подъезда/квартиры или лифта, при этом необходимо снимать какие то либо
        элементы с доставляемой техники или мебели, а также если вес прибора
        превышает 100 кг варианты и стоимость подъема обязательно обсуждаются и
        согласовываются с покупателем индивидуально до заказа доставки.
      </p>

      <p>
        <span>
          <strong> Стоимость доставки в пригород г. Киева в 10-км зоне:</strong>
        </span>
        200 грн.&nbsp;(километраж считается от черты города Киева). Доставка
        свыше 10 км - 20 грн за 1 км.&nbsp;
      </p>

      <p>
        <span>
          <span><strong>Доставка в другие города Украины</strong> </span>
          осуществляется собственной службой логистики (бесплатно при самовывозе
          из регионального офиса &quot;Алкотек&quot;) или через
          грузоперевозочные компании (за счет покупателя).
        </span>
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Delivery',
  components: {},
  data() {
    return {};
  },
};
</script>

<style lang="scss" scoped>
.delivery {
  margin: 0;
  background-color: #ffffff;
  min-height: 32.5vh;
}
.about_title {
  font-family: 'MagistralC';
  font-size: 32px;
  line-height: 42px;
  letter-spacing: 0.02em;
  color: #1d1d1d;
  font-weight: bold;
  padding-bottom: 32px;
  padding-top: 32px;
}
p {
  font-family: 'Open Sans';
  font-style: normal;
  font-weight: normal;
  font-size: 16px;
  line-height: 26px;
  color: #1d1d1d;
  padding-bottom: 32px;
}
</style>
